app/controllers/home_controller.rb

  def index
    @video_content_count = VideoContent.count
    @video_contents = VideoContent.all(:limit=>(CAROUSEL_WIDTH * CAROUSEL_HEIGHT))
---
SELECT count(*) AS count_all FROM "video_contents"
SELECT * FROM "video_contents" LIMIT 5

  def video_content_items
    @video_contents = VideoContent.all(:limit=> params['page_size'].to_i, :offset => params['offset'].to_i)
---
SELECT * FROM "video_contents" LIMIT 1 OFFSET 5