app/controllers/media_folders_controller.rb

SELECT * FROM "media_folders"
---
  def index
    @media_folders = MediaFolder.all

INSERT INTO "media_folders" ("location", "created_at", "updated_at", "scan") VALUES('/Volumes/Other/ViewMoviesTest', '2010-02-15 08:15:16', '2010-02-15 08:15:16', 't')
---
  def create
    @media_folder = MediaFolder.new(params[:media_folder])

    if @media_folder.save

UPDATE "media_folders" SET "updated_at" = '2010-02-15 08:24:44', "location" = 'test2' WHERE "id" = 2
---
  def update
    if @media_folder.update_attributes(params[:media_folder])

DELETE FROM "media_folders" WHERE "id" = 2
---
  def destroy
    flash[:notice] = "'#{@media_folder.location}' was deleted."
    @media_folder.destroy

SELECT * FROM "media_folders" WHERE ("media_folders"."id" = 2)
---
    def find_media_folder
      @media_folder = MediaFolder.find(params[:id])