app/controllers/video_file_references_controller.rb

  def index
    @page, offset = page_and_offset
    @references = VideoFileReference.all(:limit => ONBOX_CONFIG[:default_table_size], :offset => offset, :order => "raw_name")
---
SELECT * FROM "video_file_references" ORDER BY raw_name LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "video_file_references"

  def create
    @reference = VideoFileReference.new(params[:video_file_reference])
    @reference.valid?
    set_video_content
    if @reference.errors.empty? && @reference.save
---
INSERT INTO "video_file_references" ("on_disk", "location", "created_at", "updated_at", "raw_name", "video_content_id", "media_folder_id") VALUES('t', 'f', '2010-02-15 08:42:21', '2010-02-15 08:42:21', 'f', NULL, 1)

  def update
    @reference.attributes = params[:video_file_reference]
    @reference.valid?
    set_video_content
    if @reference.errors.empty? && @reference.save()
---
UPDATE "video_file_references" SET "updated_at" = '2010-02-15 10:09:50', "video_content_id" = 1 WHERE "id" = 1

    def find_reference
      @reference = VideoFileReference.find(params[:id])
---
SELECT * FROM "video_file_references" WHERE ("video_file_references"."id" = 1)

    def set_video_content
      name = params[:video_content][:name]
      if name.blank?
---
SELECT * FROM "video_contents" WHERE ("video_contents"."name" = 'Avatar') LIMIT 1