app/controllers/video_posters_controller.rb

INSERT INTO "video_posters" ("size", "location", "created_at", "updated_at", "video_content_id", "height", "width") VALUES('small', '/Volumes/Other/OnBoxPosters/avatar.small.jpg', '2010-02-08 09:50:38', '2010-02-08 09:50:38', NULL, NULL, NULL)
---
  def create
    @video_poster = @video_content.video_posters.build(params[:video_poster])

    if @video_poster.save

DELETE FROM "video_posters" WHERE "id" = 5
---
  def destroy
    @video_poster.destroy

SELECT * FROM "video_contents" WHERE ("video_contents"."id" = 17)
---
    def find_video_content
      @video_content = VideoContent.find(params[:video_content_id])

SELECT * FROM "video_posters" WHERE ("video_posters".video_content_id = 1)
---
    def find_video_poster
      @video_poster = VideoPoster.find(params[:id])