app/controllers/video_contents_controller.rb

SELECT * FROM "video_contents" ORDER BY name LIMIT 10 OFFSET 10
SELECT count(*) AS count_all FROM "video_contents"
---
  def index
    @page, offset = page_and_offset
    @video_contents = VideoContent.all(:limit => ONBOX_CONFIG[:default_table_size], :offset => offset, :order => "name")

SELECT * FROM "video_contents" WHERE (name LIKE '%%')
---
  def auto_complete
    @video_contents = VideoContent.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])

INSERT INTO "video_contents" ("name", "created_at", "plot", "updated_at", "imdb_id", "year", "release_date", "state") VALUES('Avatar', '2010-02-06 01:21:24', 'A paraplegic marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home.', '2010-02-06 01:21:24', '499549', 2009, '2009-12-17', 'NEW')
---
  def create
    if params[:video_content][:type] == 'Movie'
      @video_content = Movie.new(params[:video_content])
    elsif params[:video_content][:type]  == 'TvShow'
      @video_content = TvShow.new(params[:video_content])
    else
      raise "Unknown video content type #{params[:video_content][:type] }"
    end

    if @video_content.save

UPDATE "video_contents" SET "updated_at" = '2010-02-18 06:38:56', "imdb_id" = '', "name" = 'The Box', "release_date" = '2010-02-18', "plot" = '', "state" = 'pending' WHERE "id" = 26
SELECT * FROM "video_contents" WHERE ("video_contents"."id" = 1)
---
  def update
    update_params = params[:video_content]
    update_params = params[:movie] if @video_content.movie?
    update_params = params[:tv_show] if @video_content.tv_show?
    if update_params[:type] != @video_content.type
      logger.info "Changing item type from #{@video_content.type} to #{update_params[:type]}"
      @video_content.change_type(update_params[:type])
    end

    if @video_content.update_attributes(update_params)
      # Reload if type changed to ensure class type is changed
      @video_content = VideoContent.find(params[:id]) if update_params[:type] != @video_content.type

DELETE FROM "video_contents" WHERE "id" = 14
---
  def destroy
    flash[:notice] = "#{@video_content.name} was removed."
    @video_content.destroy

SELECT * FROM "video_contents" WHERE ("video_contents"."id" = 14)
---
    def find_video_content
      @video_content = VideoContent.find(params[:id])